Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.ShearAreaWeakAxis
Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.ShearAreaStrongAxis
Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.WarpingConstant
Warping constant (Cw, Iomega, H)
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.TorsionalModulus
Section modulus for calculations of torsion stresses (Ct)
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.TorsionalMomentOfInertia
Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.PlasticModulusWeakAxis
Plastic section modulus in bending about main weak axis.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.PlasticModulusStrongAxis
Plastic section modulus in bending about main strong axis (Z, Wpl)
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.ElasticModulusWeakAxis
Elastic section modulus about main weak axis for calculation of bending stresses.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.ElasticModulusStrongAxis
Elastic section modulus about main strong axis for calculation of bending stresses.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.MomentOfInertiaWeakAxis
Moment of Inertia about main weak axis (I).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.MomentOfInertiaStrongAxis
Moment of Inertia about main strong axis (I).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.NominalWeight
Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.Perimeter
Painting surface of the unit length.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.SectionArea
Cross section area.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.PrincipalAxesAngle
Rotation angle between the principal axes and cross section reference planes.
Since:
2015